import React from 'react';
import { Row, Col } from 'antd';
import styled from 'styled-components';

const Agreement = () => {
  return (
    <RowWrap>
      <Col>
        憶起關懷APP（以下簡稱本服務）為智慧時尚股份有限公司（以下簡稱本公司）所經營管理與擁有。
        <h1>使用者之義務與規範</h1>
        <p>
          當使用者開始使用本服務時，即視為使用者已閱讀、瞭解並同意接受本服務條款所載之內容，若有不同意接受服務條款所載內容，或使用者所屬之國家或地區排除本服務條款內容之全部或一部分時，應立即停止使用本服務。
        </p>
        <p>
          本公司有權修改或變更本服務條款之內容，使用者應隨時注意該等修改或變更。若於修改或變更後繼續使用本服務，視為使用者已閱讀、瞭解並同意接受所修改或變更後之內容，若有不同意接受所修改或變更後之內容，應立即停止使用本服務。
        </p>
        <p>
          若為未滿二十歲或有其他法律上之事由而無行為能力或為限制行為能力者，應於法定代理人閱讀、瞭解並同意接受本服務條款所載及修改變更之內容後，始得使用本服務。一經使用本服務，則視為其法定代理人已閱讀、瞭解並同意接受本服務條款所載及修改變更之內容。
        </p>
        <p>
          在使用本服務時，使用者應遵守中華民國法令及一切國際條約與慣例。使用者所發表的一切言論，以及從事的一切行為，應自行負全部的法律責任，與本服務無涉。若使用者侵害本服務、本公司或第三人權益，或從事其他不法行為，將停止提供對使用者的服務，並依情形移送檢警機關依法偵辦。
        </p>
        <p>
          若有任何違反本服務條款或法令之情事發生時，本服務得隨時拒絕使用者使用本服務所提供之一部分或全部服務，本服務得扣除使用者帳號內之點數及回收商品序號，使用者不得對本服務或本公司主張任何權利。
        </p>
        <p>
          本公司得終止使用者的會員帳號或本服務之使用，並將本服務內任何內容進行調整或刪除。若本服務之使用被終止，本公司對使用者或任何第三人均不承擔責任。關於使用者帳戶、使用本服務，或爭端解決等任何事宜，以本公司最終決策為準。使用者同意於使用本服務過程中所有資料記錄，均以本服務所儲存之電子資料為準，如有糾紛或訴訟，將以本服務所儲存之電子資料為準。
        </p>
        <h1>隱私權保護</h1>
        <p>
          本服務非常重視您的個人資料安全。對於您所登錄或留存之帳號(電子郵件信箱)、密碼、姓名與地理位置資料等，進行蒐集、處理及利用時，本服務會依照個人資料保護法與相關法令規定，辦理相關事宜，本服務絕對尊重並予以保護您的個人資料。請您於註冊前及使用本服務前，先詳細閱讀本服務「服務條款及隱私權政策」。如果您經過考慮後不同意，請您不要進行註冊程序，或立即停止使用本服務。
        </p>
        <p>
          您同意授權本服務之目的，提供必要會員資料予合作夥伴於約定範圍內使用。本服務中有部分特定服務是與其他合作廠商共同提供，如果您不願將個人資料揭露給其他合作廠商，可以選擇不使用這些特定服務，但當您開始使用這些特定服務時，我們將視為您已同意我們將你的個人資料揭露給該特定服務之合作廠商或夥伴，辦理該特定服務相關事宜。
        </p>
        <h1>使用者帳號與安全性</h1>
        <p>
          使用者需依本服務註冊表之提示提供使用者本人正確、最新的資料，並即時維持並更新使用者個人資料，確保其正確性。使用者使用本服務，即同意本公司檢查並記錄使用者的地理位置。若使用者提供任何錯誤或不實的資料、或未按指示提供資料、或欠缺必要資料時，本服務得不經事先通知，逕行暫停或終止該帳號，並拒絕使用者使用本服務之全部或部份功能。
        </p>
        <p>
          完成本服務的註冊程序之後，使用者需維持密碼及帳號之機密安全。任何依照規定方法成功登入本服務，均視為該使用者本人所使用。利用帳號所進行的一切行動，使用者將負完全的責任。使用者帳號及密碼遭盜用、不當使用或其他本公司無法辯識是否為本人親自使用之情況時，本公司對此所致之損害，概不負責。
        </p>
        <p>
          本公司無法掌控使用者存取及使用本服務所需的電信網路及網路服務，若發生任何故障情事，包括但不限於斷線、連線速度緩慢、資料傳輸速度緩慢，本公司概不負責。
        </p>
        <p>
          本服務所屬位置所對應之標的物可能因網路連線不穩、手機藍芽故障等因素而不存在於指定地點，顯示位置僅供參考。
        </p>
        <h1>智慧財產權與商譽</h1>
        <p>
          本公司所使用之商標、服務商標、品牌名稱、活動名稱、產品名稱及服務內容，包括但不限於軟體、圖案、圖片、視覺設計、照片、動畫、影片、音樂、聲音和文字，均為本公司所有或本公司取得授權使用。使用本服務不代表使用者取得上述智慧財產權之任何授權或其他權力。未經本公司事前書面同意，使用者不得在任何情況下使用上述智慧財產權。亦不得作為非本服務指定之用途，如有違反，須負損害賠償責任。
        </p>
        <p>
          本公司擁有本服務之軟體原始碼、結構與組織，及其著作權、商業機密、智慧財產權及其他相關權利。非經本公司書面授權，使用者不得：重製、散布、出版、進行逆向工程、反編譯、分解、編輯、改作或翻譯本軟體，或試圖取得本軟體之原始碼，或製作本服務之衍生產品；出售、讓渡、再授權、轉讓、分配或者出租本服務；以法律所規範禁止之方式使用本服務。
        </p>
        <p>
          使用者不得從事任何會傷害或可能會傷害本公司、本公司商標、本服務與本公司商譽的任何行為，亦不從事傷害本公司之其他公司、本公司授權之公司、上述公司員工商譽及名譽的任何行為。
        </p>
        <p>
          使用者保證使用者在本網站與本服務中使用的名稱與影像皆未侵害任何第三方之智慧財產權、隱私權或其他權利。使用者授權本公司得於本服務相關之任何活動使用上述名稱與影像，此授權為全球性、無授權金、不得撤回、可轉讓、可轉授權之權利。
        </p>
        <h1>廣告合作內容</h1>
        <p>
          本服務僅為商家與消費者間之媒介，本服務歡迎所有相關之廣告合作案，使用者於本服務瀏覽到的所有廣告內容、文字與圖片之說明，均由各該廣告商、產品與服務供應商所提供。但對於合作廠商或個人於本服務或所屬網頁上所刊登之一切訊息，本服務不負擔資訊正確性與完整性等所有相關之責任，使用者應自行判斷廣告內容及相關網頁訊息是否合乎需求之責任，本公司僅接受委託予以刊登，不對前述廣告負擔保責任，亦不負任何損害賠償責任。
        </p>
        <p>
          本服務所提供之各項功能，均依該功能當時之現況提供使用，本服務對於其效能、速度、完整性、可靠性、安全性、正確性等，皆不負擔任何明示或默示之擔保責任。
        </p>
        <h1>禁止事項</h1>
        <p>
          外援程式：使用者應親自使用本服務，使用者不得使用本軟體之外的電腦軟體、非軟體基礎的資料庫或人物檔案或其他管道取得點數或完成任務。
        </p>
        <p>
          自動程式：使用者針對本服務所從事的所有行為，均須透過本軟體所提供的介面，由使用者親自為之。使用者不得使用機器人等自動程式參與服務。
        </p>
        <p>
          使用者不得以任何非法之目的或方法使用本服務，亦不得利用本服務從事侵害他人權利或違法之行為，禁止事項包括但不限於以下事項：
        </p>
        <ul>
          <li>冒名使用本服務。</li>
          <li>未經本服務書面同意，以任何手段從事廣告及商業行為。</li>
          <li>同時申請多個不實帳戶，以從事違反本條款之行為。</li>
          <li>發表具有攻擊性、毀損他人名譽或無事實根據之言論。</li>
          <li>上傳、張貼色情、暴力或不適於公開場合發表之文字、圖片或連結。</li>
          <li>上傳、張貼具有病毒之檔案或連結，引導其他使用者連結之。</li>
          <li>違反本條款與隱私權政策。</li>
          <li>會員本身有詐欺或違反法律之行為。</li>
          <li>其他本公司所認為不適當之行為。</li>
        </ul>
        <p>
          使用者同意本公司得採取行動以偵測並防止被禁止之使用方式，這些行動包括但不限於檢查使用者電腦上與本軟體運行的程式。使用者同意不迴避、干擾、阻擋上述行動，包括但不限於使用第三方軟體從事上述目的。使用者不得公開及散佈任何禁止事項或違反本服務條款之方式。
        </p>
        <h1>免責聲明</h1>
        <p>
          本公司得暫停、中斷、修改、移除或增加本服務條款之內容，本服務得更改或停止服務，且上述變更一經發生立即生效，本公司不負通知使用者上述任何變更之義務。對於此類變更決定所引起使用者的任何損失，本公司概不負責。
        </p>
        <p>
          本公司不保證本服務之軟體、網頁、伺服器、網域等所傳送的內容完全正確且無害；亦不保證郵件、檔案或資料之傳輸儲存均正確無誤不會斷線和出錯等。因上述所致之損害，本公司不負賠償責任。使用者同意於使用本服務過程中所有資料記錄，以本公司資料庫所儲存之電子資料為準，如有糾紛或訴訟，以該電子資料為認定標準。
        </p>
        <p>
          本服務條款之解釋與適用，以及與本服務條款有關的爭議，除法律另有規定者外，均應依照中華民國法律予以處理，並約定以台灣台北地方法院為第一審管轄法院。
        </p>
        <p>
          本服務條款中所列之各項條文，並不會因為使用者取得本服務口頭或書面之保證而增加本公司之義務。本服務以及其合作廠商、個人與公司並不保證如下事項：
        </p>
        <p>
          本服務可完全滿足使用者之需求；本服務之內容完全正確；使用本服務所提供內容之結果能達到會員之預期目標；所有APP軟體設計上所發生之問題均能獲得改善。
        </p>
      </Col>
    </RowWrap>
  );
};

const RowWrap = styled(Row)`
  background-color: rgb(121, 171, 229, 0.5);
  min-height: 100vh;
  padding: 20px 40px 50px;
`;
export default Agreement;
